### Data Flame　インデックスをもつ２次元データ

In [3]:
import pandas as pd

In [4]:
val = [[1,2,3,],[4,5,6]]

In [7]:
df = pd.DataFrame(val)
print(df)

   0  1  2
0  1  2  3
1  4  5  6

In [9]:
df = pd.DataFrame(val,dtype=float)
print(df)

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  6.0

In [10]:
df.dtypes

0    float64
1    float64
2    float64
dtype: object

In [14]:
val = [[1,2,3,],[4,5,6]]
df = pd.DataFrame(val,index = ['ro','r1'], columns = ['c0','c1','c2'])
print(df)

    c0  c1  c2
ro   1   2   3
r1   4   5   6

In [18]:
### Seriesを使った

In [27]:
sr_age = pd.Series([23,31,49,60])
sr_gender = pd.Series(['M','F','F','M'])
sr_height = pd.Series([175, 160, 156, 180])
sr_weight = pd.Series([65,40,48,85])

In [28]:
df_info = pd.DataFrame({
    'age': sr_age,
    'gender': sr_gender,
    'height': sr_height,
    'weight': sr_weight
})
print(df_info)

   age gender  height  weight
0   23      M     175      65
1   31      F     160      40
2   49      F     156      48
3   60      M     180      85

In [30]:
sr_age = pd.Series([23,31,49,60], index = ['Sato','Yamada', 'Suzuki', 'Tanaka'])
sr_gender = pd.Series(['M','F','M'], index = ['Sato','Yamada', 'Suzuki'])
sr_height = pd.Series([160, 156, 180],index = ['Yamada', 'Suzuki', 'Tanaka'])
sr_weight = pd.Series([65,85],index = ['Sato','Tanaka'])

In [31]:
df_info = pd.DataFrame({
    'age': sr_age,
    'gender': sr_gender,
    'height': sr_height,
    'weight': sr_weight
})
print(df_info)

        age gender  height  weight
Sato     23      M     NaN    65.0
Suzuki   49      M   156.0     NaN
Tanaka   60    NaN   180.0    85.0
Yamada   31      F   160.0     NaN

In [ ]:
### DataFrameの参照

In [35]:
sr_age = pd.Series([23,31,49,60], index = ['Sato','Yamada', 'Suzuki', 'Tanaka'])
sr_gender = pd.Series(['M','F','M'], index = ['Sato','Yamada', 'Suzuki'])
sr_height = pd.Series([160, 156, 180],index = ['Yamada', 'Suzuki', 'Tanaka'])
sr_weight = pd.Series([65,85],index = ['Sato','Tanaka'])

In [36]:
df_info = pd.DataFrame({
    'age': sr_age,
    'gender': sr_gender,
    'height': sr_height,
    'weight': sr_weight
})

In [37]:
df_info

        age gender  height  weight
Sato     23      M     NaN    65.0
Suzuki   49      M   156.0     NaN
Tanaka   60    NaN   180.0    85.0
Yamada   31      F   160.0     NaN

In [39]:
df_info.shape

(4, 4)

In [41]:
print(df_info.shape[0])
print(df_info.shape[1])

4
4

In [43]:
df_info.size

16

In [45]:
df_info['age']

Sato      23
Suzuki    49
Tanaka    60
Yamada    31
Name: age, dtype: int64

In [47]:
df_info[['age','weight']]

        age  weight
Sato     23    65.0
Suzuki   49     NaN
Tanaka   60    85.0
Yamada   31     NaN

In [48]:
### ロックアトリビュート

In [51]:
df_info.loc['Suzuki']

age          49
gender        M
height    156.0
weight      NaN
Name: Suzuki, dtype: object

In [54]:
df_info.loc['Suzuki','height']

156.0

In [56]:
df_info.loc['Suzuki':'Yamada','height']

Suzuki    156.0
Tanaka    180.0
Yamada    160.0
Name: height, dtype: float64

In [58]:
df_info.loc['Suzuki',:]

age          49
gender        M
height    156.0
weight      NaN
Name: Suzuki, dtype: object

In [59]:
### iloc 番号指定

In [60]:
sr_age = pd.Series([23,31,49,60], index = ['Sato','Yamada', 'Suzuki', 'Tanaka'])
sr_gender = pd.Series(['M','F','M'], index = ['Sato','Yamada', 'Suzuki'])
sr_height = pd.Series([160, 156, 180],index = ['Yamada', 'Suzuki', 'Tanaka'])
sr_weight = pd.Series([65,85],index = ['Sato','Tanaka'])

In [61]:
df_info = pd.DataFrame({
    'age': sr_age,
    'gender': sr_gender,
    'height': sr_height,
    'weight': sr_weight
})

In [63]:
df_info

        age gender  height  weight
Sato     23      M     NaN    65.0
Suzuki   49      M   156.0     NaN
Tanaka   60    NaN   180.0    85.0
Yamada   31      F   160.0     NaN

In [65]:
df_info.iloc[1,2]

156.0

In [67]:
df_info.iloc[1:5,2]

Suzuki    156.0
Tanaka    180.0
Yamada    160.0
Name: height, dtype: float64

In [69]:
df_info.iloc[1,:]

age          49
gender        M
height    156.0
weight      NaN
Name: Suzuki, dtype: object

In [ ]:
### 条件抽出

In [70]:
df_info[df_info['height'] > 170]

        age gender  height  weight
Tanaka   60    NaN   180.0    85.0

In [74]:
df_info[df_info['gender'] == 'M']

        age gender  height  weight
Sato     23      M     NaN    65.0
Suzuki   49      M   156.0     NaN

In [82]:
df_info[df_info['gender'] == 'F']

        age gender  height  weight
Yamada   31      F   160.0     NaN

In [ ]:
### Head Tail 　何が入っているかを見るとき

In [85]:
df_info.head(2)

        age gender  height  weight
Sato     23      M     NaN    65.0
Suzuki   49      M   156.0     NaN

In [86]:
df_info.tail(2)

        age gender  height  weight
Tanaka   60    NaN   180.0    85.0
Yamada   31      F   160.0     NaN

### Data Flameの要素の変更

In [87]:
sr_age = pd.Series([23,31,49,60], index = ['Sato','Yamada', 'Suzuki', 'Tanaka'])
sr_gender = pd.Series(['M','F','M'], index = ['Sato','Yamada', 'Suzuki'])
sr_height = pd.Series([160, 156, 180],index = ['Yamada', 'Suzuki', 'Tanaka'])
sr_weight = pd.Series([65,85],index = ['Sato','Tanaka'])

In [88]:
df_info = pd.DataFrame({
    'age': sr_age,
    'gender': sr_gender,
    'height': sr_height,
    'weight': sr_weight
})

        age gender  height  weight
Sato     23      M     NaN    65.0
Suzuki   49      M   156.0     NaN
Tanaka   60    NaN   180.0    85.0
Yamada   31      F   160.0     NaN

In [92]:
df_info['height'] = 175

In [93]:
df_info

        age gender  height  weight
Sato     23      M     175    65.0
Suzuki   49      M     175     NaN
Tanaka   60    NaN     175    85.0
Yamada   31      F     175     NaN

In [94]:
df_info.loc['Sato','weight'] = 100

In [96]:
df_info

        age gender  height  weight
Sato     23      M     175   100.0
Suzuki   49      M     175     NaN
Tanaka   60    NaN     175    85.0
Yamada   31      F     175     NaN

In [97]:
df_info.iloc[0] = 30

In [98]:
df_info

        age gender  height  weight
Sato     30     30      30    30.0
Suzuki   49      M     175     NaN
Tanaka   60    NaN     175    85.0
Yamada   31      F     175     NaN

In [99]:
df_info.iloc[0,1] = 'M'

In [100]:
df_info

        age gender  height  weight
Sato     30      M      30    30.0
Suzuki   49      M     175     NaN
Tanaka   60    NaN     175    85.0
Yamada   31      F     175     NaN

In [101]:
sr_age = pd.Series([23,31,49,60], index = ['Sato','Yamada', 'Suzuki', 'Tanaka'])
sr_gender = pd.Series(['M','F','M'], index = ['Sato','Yamada', 'Suzuki'])
sr_height = pd.Series([160, 156, 180],index = ['Yamada', 'Suzuki', 'Tanaka'])
sr_weight = pd.Series([65,85],index = ['Sato','Tanaka'])

In [102]:
df_info = pd.DataFrame({
    'age': sr_age,
    'gender': sr_gender,
    'height': sr_height,
    'weight': sr_weight
})

In [103]:
df_info

        age gender  height  weight
Sato     23      M     NaN    65.0
Suzuki   49      M   156.0     NaN
Tanaka   60    NaN   180.0    85.0
Yamada   31      F   160.0     NaN

In [104]:
df_info['new_colum'] = 1
df_info.loc['new_index'] = 0

In [106]:
df_info

           age gender  height  weight  new_colum
Sato        23      M     NaN    65.0          1
Suzuki      49      M   156.0     NaN          1
Tanaka      60    NaN   180.0    85.0          1
Yamada      31      F   160.0     NaN          1
new_index    0      0     0.0     0.0          0

In [107]:
### DataFlameの行と列の削除

In [108]:
df_info

           age gender  height  weight  new_colum
Sato        23      M     NaN    65.0          1
Suzuki      49      M   156.0     NaN          1
Tanaka      60    NaN   180.0    85.0          1
Yamada      31      F   160.0     NaN          1
new_index    0      0     0.0     0.0          0

In [109]:
df_info.drop(labels ='new_colum',axis=1)

           age gender  height  weight
Sato        23      M     NaN    65.0
Suzuki      49      M   156.0     NaN
Tanaka      60    NaN   180.0    85.0
Yamada      31      F   160.0     NaN
new_index    0      0     0.0     0.0

In [110]:
### 列であることの指定　axis = 1

In [112]:
df_info

           age gender  height  weight  new_colum
Sato        23      M     NaN    65.0          1
Suzuki      49      M   156.0     NaN          1
Tanaka      60    NaN   180.0    85.0          1
Yamada      31      F   160.0     NaN          1
new_index    0      0     0.0     0.0          0

In [113]:
df_info.drop(labels ='new_colum',axis=1,inplace = True)

In [114]:
df_info

           age gender  height  weight
Sato        23      M     NaN    65.0
Suzuki      49      M   156.0     NaN
Tanaka      60    NaN   180.0    85.0
Yamada      31      F   160.0     NaN
new_index    0      0     0.0     0.0

In [116]:
df_info.drop(labels=['height','weight'],axis=1,inplace = True)

In [120]:
df_info

           age gender
Sato        23      M
Suzuki      49      M
Tanaka      60    NaN
Yamada      31      F
new_index    0      0

In [122]:
#### 行の削除

In [124]:
df_info.drop(labels = 'new_index', axis = 0, inplace = True)

In [125]:
df_info

        age gender
Sato     23      M
Suzuki   49      M
Tanaka   60    NaN
Yamada   31      F

In [126]:
df_info.drop(labels =['Suzuki', 'Tanaka'], axis = 0, inplace = True)

In [127]:
df_info

        age gender
Sato     23      M
Yamada   31      F